application/xml_req_templates/HotelCreateReservationReq.xml

<?xml version="1.0" encoding="ISO-8859-1"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
<soapenv:Body>
<HotelCreateReservationReq xmlns="http://www.travelport.com/schema/universal_v33_0" TraceId="6e997564-6337-4a6b-9890-68eba168fd6a" AuthorizedBy="Chetan" TargetBranch="P7030029" ProviderCode="1G" UserAcceptance="true">
  <BillingPointOfSaleInfo xmlns="http://www.travelport.com/schema/common_v33_0" OriginApplication="uAPI" />
  <BookingTraveler xmlns="http://www.travelport.com/schema/common_v33_0" Key="MVhQY2tyamxnaEEwVzJhYg==" TravelerType="ADT" Age="40" DOB="1976-01-21" Gender="M" Nationality="US">
    <BookingTravelerName Prefix="Mr" First="John" Last="Smith" />
    <DeliveryInfo>
      <ShippingAddress Key="1">
        <Street>Via Augusta 59 5</Street>
        <City>Madrid</City>
        <PostalCode>50156</PostalCode>
      </ShippingAddress>
    </DeliveryInfo>
    <PhoneNumber Location="DEN" CountryCode="1" AreaCode="303" Number="123456789" />
    <Email EmailID="johnsmith@travelportuniversalapidemo.com" />
    <Address>
      <AddressName>DemoSiteAddress</AddressName>
      <Street>Via Augusta 59 5</Street>
      <City>Madrid</City>
      <State>IA</State>
      <PostalCode>50156</PostalCode>
      <Country>US</Country>
    </Address>
  </BookingTraveler>
  <HotelRateDetail xmlns="http://www.travelport.com/schema/hotel_v33_0" RatePlanType="L04DZZZ" />
  <HotelProperty xmlns="http://www.travelport.com/schema/hotel_v33_0" HotelCode="93402" HotelChain="LW" />
  <HotelStay xmlns="http://www.travelport.com/schema/hotel_v33_0">
    <CheckinDate>2016-03-20</CheckinDate>
    <CheckoutDate>2016-03-22</CheckoutDate>
  </HotelStay>
  <Guarantee xmlns="http://www.travelport.com/schema/common_v33_0" Type="Guarantee">
    <CreditCard Type="VI" Number="4444333322221111" ExpDate="2016-12" CVV="123" />
  </Guarantee>
  <GuestInformation xmlns="http://www.travelport.com/schema/hotel_v33_0" NumberOfRooms="1">
    <NumberOfAdults>1</NumberOfAdults>
  </GuestInformation>
</HotelCreateReservationReq>
</soapenv:Body>
</soapenv:Envelope>